public class Main {
    public static void main(String[] args) {
        //Задаваме големина на матрицата[5,5], кординати на начална точка [0,0] и кординати на крайна точка[4,4]
        AStar аStar = new AStar(5, 5, 0, 0, 4, 4,
                //задаваме клетките от масива, на които не може да се стъпва
                new int[][]{{0, 4}, {2, 2}, {3, 1}, {3, 3}, {2, 1}, {2, 3},{3,4}});
        аStar.display();
        аStar.process();//Прилага А* алгоритъма
        аStar.displayScores();//показва резултатите върху кординатната мрежа
        аStar.displaySolution();//показва решението
    }
}